openFOAM_mesh/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 24.67;

boundaryField
{
    inletOutlet
    {
        type            freestream;
        freestreamValue uniform 24.67;
        value           uniform 24.67;
    }
    airfoil
    {
        type            omegaWallFunction;
        value           uniform 24.67;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
